def caching_fibonacci():
    '''
    Ф-ія обгортка, для збереження кешу ф-ії Фібоначчі
    '''
    # словник зі збереженими результатами кешування
    cache = {}

    def fib(n):
        '''
        Ф-ія для обчислення n-го числа Фібоначчі з використанням кешування
        Args:
            n (int): номер числа Фібоначчі
        Returns:
            (int): n-те число Фібоначчі
        '''
        # місце виходу з рекурсії
        if n <= 0:
            return 0
        if n == 1:
            return 1

        # перевірка чи є результат у кеші
        if n in cache:
            return cache[n]

        cache[n] = fib(n-1) + fib(n-2)  # збереження результату у кеші
        return cache[n]

    return fib
