def caching_fibonacci():
	'''
	Ф-ія обгортка, для збереження кешу ф-ії Фібоначчі
	'''
	cache = {} # словник зі збереженними результатами кешування (виклику ф-ії Фібоначчі)

	def fib(n):
		'''
		Ф-ія для обчислення n-го числа Фібоначчі з використанням кешування (memoization)
		Args:
			n (int): номер числа Фібоначчі
		Returns:
			(int): n-те число Фібоначчі
		'''
		# місце виходу з рекурсії
		if n <= 0:
			return 0
		if n == 1:
			return 1
		
		# перевірка чи є результат у кеші
		if n in cache:
			return cache[n]

		cache[n] = fib(n-1) + fib(n-2) # збереження результату у кеші
		return cache[n]

	return fib

